Run/Base_Cases_Run_1100_um/Base_Case_Run/CFD/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions       [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    /*inlet
    {
        type            zeroGradient;
    }*/

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    ".*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    freeSurface
    {
    	 type		totalPressure;
    	 p0		uniform 0;	
    }

}

// ************************************************************************* //

