Run/Base_Cases_Run_1100_um/Base_Case_Run/CFD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4969419.357575891;//7e-3; //http://ichrome.com/blogs/archives/342

boundaryField
{
    outlet
    {
        //type 		  zeroGradient;
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    
    freeSurface
    {
    	type			slip;
    }
    
    ".*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
